BIP/ftp_soap


WSDL: https://<host:port>/xmlpserver/services/v2/ReportService?wsdl









Public Services: Expects credentials in the payload/body of the SOAP envelope.
ReportService: runReport method (See ReportService in Developer's Guide for Oracle Business Intelligence Publisher.)
xmlpserver/services/v2/ReportService?wsdl
ScheduleService: getDocumentData method (See ScheduleService in Developer's Guide for Oracle Business Intelligence Publisher.)
xmlpserver/services/v2/ScheduleService?wsdl
Protected Services: Expects credentials as part of headers in the SOAP envelope.
Note
This service is recommended if you have to use synchronous calls for BI reports.
ExternalReportWSSService: runReport method
xmlpserver/services/ExternalReportWSSService?wsdl
ScheduleReportWSSService: getDocumentData method
xmlpserver/services/ScheduleReportWSSService?wsdl
When the SOAP Adapter calls an Oracle Fusion Applications business intelligence publisher (BIP) report synchronously, the report data is always returned as a base64-encoded string in the response. These services do not support attachments in the response. In this case, the feature to configure MTOM support in the SOAP Adapter does not work.

Handling the BI Response

The BI response can be parsed in the integration with the following approaches:
Recommended: Use the decodeBase64ToReference mapper function to convert the base64 string to a file reference and use the file reference in a stage file action/FTP Adapter read file operation scenario for further processing.
Alternative: Write the base64 string using an opaque schema to a file using a stage file action/FTP Adapter write file operation scenario, then read the file using a stage file action/FTP Adapter scenario for further processing.
Note
Upon calling a BIP report synchronously, the request sent to the BIP web service initiates report generation and sends a response back after the report is generated. This can cause latency issues in an Oracle Integration environment.
For the above reason, calling BI report services synchronously with the SOAP Adapter is recommended for short-running and/or small size reports. Be aware of the payload size restrictions. See Service Limits in Provisioning and Administering Oracle Integration 3.
---------------------------------------------------------------


Request Payload to run BI Report using SOAP


<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:pub="http://xmlns.oracle.com/oxp/service/PublicReportService">
   <soap:Header/>
   <soap:Body>
      <pub:runReport>
         <pub:reportRequest>
            <pub:attributeFormat/>
            <pub:parameterNameValues>
               <!--Zero or more repetitions:-->
               <pub:item>
                  <pub:name/>
                  <pub:values>
                     <!--Zero or more repetitions:-->
                     <pub:item/>
                  </pub:values>
               </pub:item>
            </pub:parameterNameValues>
            <pub:reportAbsolutePath>/Custom/XX_DEMO_VIS/xx_soap_rpt.xdo</pub:reportAbsolutePath>
            <pub:sizeOfDataChunkDownload>-1</pub:sizeOfDataChunkDownload>
         </pub:reportRequest>
      </pub:runReport>
   </soap:Body>
</soap:Envelope>

------------------------------------------------------------------------------------------------------------------------------
Operation Name: runReport
---------------------------
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:v2="http://xmlns.oracle.com/oxp/service/v2">
   <soapenv:Header/>
   <soapenv:Body>
      <v2:runReport>
         <v2:reportRequest>
            <v2:attributeFormat>pdf</v2:attributeFormat>
            <v2:parameterNameValues>
               <v2:listOfParamNameValues>
                  <!--Zero or more repetitions:-->
                  <v2:item>
                     <v2:name>p_source</v2:name>
                     <v2:values>
                        <v2:item>ISP</v2:item>
                     </v2:values>
                  </v2:item>
                  <v2:item>
                     <v2:name>p_inv_num</v2:name>
                     <v2:values>
                        <v2:item>UK16</v2:item>
                     </v2:values>
                  </v2:item>
               </v2:listOfParamNameValues>
            </v2:parameterNameValues>
            <v2:reportAbsolutePath>/Custom/Financials/XXDEMO_RTF_TEMPLATE.xdo</v2:reportAbsolutePath>
         </v2:reportRequest>
         <v2:userID>FIN_IMPL</v2:userID>
         <v2:password>DayH33Ya7</v2:password>
      </v2:runReport>
   </soapenv:Body>
</soapenv:Envelope>

------------------------------------------------------------------------------------------------------------------------------

ScheduleService

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope"
               xmlns:sch="http://xmlns.oracle.com/oxp/service/ScheduleReportService">
   <soap:Header/>
   <soap:Body>
      <sch:scheduleReport>
         <scheduleRequest>
            <deliveryChannels>
               <ftpOptions>
                  <ftpServerName>TEST</ftpServerName>
                  <remoteFile>/home/ubuntu/outbound/invoice/Invoice2.csv</remoteFile>
                  <sftpOption>true</sftpOption>
               </ftpOptions>
            </deliveryChannels>
            <reportAttributes>
               <attributeFormat>csv</attributeFormat>
            </reportAttributes>
            <parameterNameValues>
               <listOfParamNameValues>
                  <name>p_source</name>
                  <values>PSIIF</values>
               </listOfParamNameValues>
               <listOfParamNameValues>
                  <name>p_inv_num</name>
                  <values>1620314</values>
               </listOfParamNameValues>
            </parameterNameValues>
            <reportAbsolutePath>/Custom/Financials/XXDEMO_RFT_TEMPLATE.xdo</reportAbsolutePath>
            <saveDataOption>true</saveDataOption>
            <saveOutputOption>true</saveOutputOption>
            <schedulePublicOption>true</schedulePublicOption>
            <userJobName>Test Job SOAP</userJobName>
         </scheduleRequest>
      </sch:scheduleReport>
   </soap:Body>
</soap:Envelope>

------------------------------------------------------------------------------------------------------------------------------
1. FTP (File Transfer Protocol)

Purpose: To transfer files from one system to another, often between a remote server (like a cloud source) and your local system.

Use Case:
You receive large files that are too big to send via email.
Example: Monthly financial reports, invoices, or large datasets.

How it works:
You connect to an FTP server using credentials.
Upload or download files securely (SFTP adds encryption).
Analogy: Like a cloud mailbox for large files. Email is limited in size, but FTP handles large files efficiently.


Client IT → generates key pair
   ├─ Private key → stays with client (never shared)
   └─ Public key → uploaded to client SFTP server

 BI Publisher → configure SFTP using:
   ├─ Server, username
   └─ Public key (or password)
Reports → sent automatically to SFTP server
Client → downloads/uses reports from SFTP


-----------------------------------------------------------------------------
2. SoapUI

Purpose: To test APIs (SOAP, REST, GraphQL) and ensure they behave correctly and securely.

Use Case in your example:
Suppose the FTP service is exposed via a web service API. You can’t just assume it works perfectly.

SoapUI lets you test:
Functionality: Does the service return the correct response?

Security: Is the data transfer safe? Can unauthorized access happen?
Error handling: Does it behave correctly under invalid inputs or failures?

Analogy: SoapUI is like a “tester” or “inspector” for the service, making sure it works and is secure before you use it.


Putting it together

FTP = moves the file from cloud to your system.
SoapUI = tests whether the service (like FTP exposed via API) is working correctly and safely.
 FTP handles the file transfer, and SoapUI is used to validate the service handling that transfer, especially if it’s secure or exposed via an API.
